{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "A": 0,
      "B": 1,
      "C": 2,
      "D": 3,
      "G": 4,
      "H": 5,
      "K": 6,
      "M": 7,
      "N": 8,
      "R": 9,
      "S": 10,
      "T": 11,
      "V": 12,
      "W": 13,
      "Y": 14,
      "TT": 15,
      "AA": 16,
      "GC": 17,
      "TC": 18,
      "GA": 19,
      "GG": 20,
      "CC": 21,
      "TA": 22,
      "TG": 23,
      "CA": 24,
      "TGC": 25,
      "AAA": 26,
      "GGC": 27,
      "TAA": 28,
      "TCA": 29,
      "TGA": 30,
      "GTT": 31,
      "GAA": 32,
      "GCA": 33,
      "GCC": 34,
      "TTA": 35,
      "TGG": 36,
      "TTC": 37,
      "TCC": 38,
      "GGA": 39,
      "CCA": 40,
      "GTC": 41,
      "TTTT": 42,
      "TAC": 43,
      "GAC": 44,
      "AAC": 45,
      "GTA": 46,
      "TAAA": 47,
      "CCC": 48,
      "AAAA": 49,
      "TGGC": 50,
      "CAC": 51,
      "TGAA": 52,
      "TATT": 53,
      "TGCA": 54,
      "TGCC": 55,
      "GCGC": 56,
      "TGTT": 57,
      "GAAA": 58,
      "TCAA": 59,
      "GGCA": 60,
      "TCTT": 61,
      "TGGA": 62,
      "GCCA": 63,
      "GGCC": 64,
      "TCCA": 65,
      "GCTT": 66,
      "GATT": 67,
      "GCAA": 68,
      "GGAA": 69,
      "GCCC": 70,
      "TCGA": 71,
      "GGTT": 72,
      "TGAC": 73,
      "GTAA": 74,
      "GTG": 75,
      "GTCA": 76,
      "TACC": 77,
      "GCGA": 78,
      "GTGC": 79,
      "TATC": 80,
      "AAAC": 81,
      "GCGG": 82,
      "GAAC": 83,
      "GTTC": 84,
      "TTCA": 85,
      "GCAC": 86,
      "TCCC": 87,
      "TTAC": 88,
      "GTTA": 89,
      "GACC": 90,
      "TCAC": 91,
      "GTGA": 92,
      "TTAA": 93,
      "TACA": 94,
      "GTGG": 95,
      "TAAC": 96,
      "TTCC": 97,
      "TCGG": 98,
      "TATA": 99,
      "TCGC": 100,
      "TTGA": 101,
      "GGAC": 102,
      "TAAAA": 103,
      "GTCC": 104,
      "TTTA": 105,
      "GACA": 106,
      "GATC": 107,
      "CCAC": 108,
      "GGGC": 109,
      "TTTC": 110,
      "TGTC": 111,
      "CCAA": 112,
      "TGTA": 113,
      "GCTC": 114,
      "GGTC": 115,
      "GATA": 116,
      "GAAAA": 117,
      "GTAC": 118,
      "CACC": 119,
      "TTGC": 120,
      "TTCAA": 121,
      "GAGC": 122,
      "TGAAA": 123,
      "TTGG": 124,
      "GAGG": 125,
      "GCCAA": 126,
      "GGCAA": 127,
      "TGGAA": 128,
      "GGTA": 129,
      "GCGGC": 130,
      "TCACC": 131,
      "TGGCC": 132,
      "TCTC": 133,
      "GAGA": 134,
      "GCACC": 135,
      "TTATT": 136,
      "TGCCA": 137,
      "GGCCA": 138,
      "TGCAA": 139,
      "TGGCA": 140,
      "GGGA": 141,
      "TGCCC": 142,
      "AACAA": 143,
      "TTCTT": 144,
      "GTAAA": 145,
      "GCGCC": 146,
      "TGACC": 147,
      "GGGG": 148,
      "GTTTT": 149,
      "TCGGC": 150,
      "GTGGC": 151,
      "CATT": 152,
      "CATC": 153,
      "TAGC": 154,
      "TAGA": 155,
      "TGATT": 156,
      "TCGCC": 157,
      "GCTGC": 158,
      "TAATT": 159,
      "TTACC": 160,
      "GACAA": 161,
      "CAGC": 162,
      "TCCAA": 163,
      "TAAAC": 164,
      "GCCGG": 165,
      "TACAA": 166,
      "TCAAA": 167,
      "TGAAC": 168,
      "GTGAA": 169,
      "GCCGA": 170,
      "GGCGA": 171,
      "TCATT": 172,
      "GAAAC": 173,
      "CCACC": 174,
      "GGAAA": 175,
      "TGTTC": 176,
      "TCATC": 177,
      "TATAA": 178,
      "TGCAC": 179,
      "GTGCC": 180,
      "GGCCC": 181,
      "GCCGC": 182,
      "GGCGG": 183,
      "GTTCC": 184,
      "GCAAA": 185,
      "TGCTT": 186,
      "GGCAC": 187,
      "TGGTT": 188,
      "GTCAA": 189,
      "GAACC": 190,
      "TGTAA": 191,
      "GTTAA": 192,
      "TATTA": 193,
      "CAGG": 194,
      "GATGA": 195,
      "GCGCA": 196,
      "GATAA": 197,
      "TATTTT": 198,
      "GAATT": 199,
      "GTGTT": 200,
      "TGAAAA": 201,
      "TGGAC": 202,
      "GAACA": 203,
      "TGATC": 204,
      "GTGCA": 205,
      "TTATC": 206,
      "TAAAAA": 207,
      "GCTGG": 208,
      "GCTA": 209,
      "GCAGG": 210,
      "GAAGA": 211,
      "GTTCA": 212,
      "GTGGA": 213,
      "GGCTT": 214,
      "GAAAAA": 215,
      "GCATT": 216,
      "TCGTC": 217,
      "TGTTTT": 218,
      "GGATT": 219,
      "TGTCA": 220,
      "GCCTT": 221,
      "TAGG": 222,
      "TGTCC": 223,
      "GCCCA": 224,
      "GATCA": 225,
      "TGTGC": 226,
      "CCTT": 227,
      "TATCA": 228,
      "GATGC": 229,
      "GCAGC": 230,
      "GTATT": 231,
      "CCGG": 232,
      "TCTTC": 233,
      "TGTGG": 234,
      "GGCGC": 235,
      "AAAAAA": 236,
      "TCCTT": 237,
      "TTTTTT": 238,
      "AAATT": 239,
      "TCTA": 240,
      "GGTGC": 241,
      "CACA": 242,
      "CCCC": 243,
      "GGTGA": 244,
      "GCTGA": 245,
      "TACTT": 246,
      "TGTTA": 247,
      "GACGA": 248,
      "GCTTC": 249,
      "GCATC": 250,
      "CCCAA": 251,
      "GTTGA": 252,
      "TATTC": 253,
      "CCCA": 254,
      "TTTTAA": 255,
      "GTGAC": 256,
      "GCGTC": 257,
      "GCCAC": 258,
      "TACCA": 259,
      "TCCGG": 260,
      "TCAAC": 261,
      "GCGGA": 262,
      "TGCGG": 263,
      "GCAAC": 264,
      "GACCA": 265,
      "TTACA": 266,
      "GAAGG": 267,
      "GTCAC": 268,
      "GTCCA": 269,
      "TGTGA": 270,
      "GTAAC": 271,
      "GCGTT": 272,
      "GTTAC": 273,
      "TCTGC": 274,
      "TCGAC": 275,
      "TAACC": 276,
      "GTCGA": 277,
      "AAACA": 278,
      "CACAA": 279,
      "GGCGGC": 280,
      "GCCGCC": 281,
      "GCAGA": 282,
      "TGACA": 283,
      "GCACA": 284,
      "GGTGG": 285,
      "AAACC": 286,
      "GGTCA": 287,
      "GTACC": 288,
      "GGACC": 289,
      "GCCCC": 290,
      "GGACA": 291,
      "TGTAC": 292,
      "TTATA": 293,
      "GCTCA": 294,
      "GCGAA": 295,
      "TAACA": 296,
      "TAATA": 297,
      "GTCTT": 298,
      "GATGG": 299,
      "TCGTT": 300,
      "CCATT": 301,
      "GCGAC": 302,
      "TATCC": 303,
      "TGGCAA": 304,
      "TATGA": 305,
      "AACTT": 306,
      "TATTAA": 307,
      "GAGAA": 308,
      "TCGAA": 309,
      "GGTAA": 310,
      "GATCC": 311,
      "TCTGG": 312,
      "GAGCA": 313,
      "GACTT": 314,
      "GGGCA": 315,
      "GCTCC": 316,
      "TAGTT": 317,
      "TATGC": 318,
      "GAGTT": 319,
      "TAGAA": 320,
      "GGGTT": 321,
      "GGAAC": 322,
      "TATGG": 323,
      "GTCCC": 324,
      "GAGGA": 325,
      "GTACA": 326,
      "TCTCC": 327,
      "GGGAA": 328,
      "TCCCA": 329,
      "AATT": 330,
      "TCCAC": 331,
      "TCTTTT": 332,
      "TCACA": 333,
      "GATTA": 334,
      "TGCTGC": 335,
      "TTCTTC": 336,
      "GACGG": 337,
      "TCCCC": 338,
      "TGCCAA": 339,
      "TAAATT": 340,
      "TCAGG": 341,
      "GATTC": 342,
      "GTAAAA": 343,
      "GCTTTT": 344,
      "GCTAA": 345,
      "GAAGAA": 346,
      "TTAAA": 347,
      "GTCGG": 348,
      "GCAGCA": 349,
      "TGATA": 350,
      "GATTTT": 351,
      "TTCGG": 352,
      "TAATAA": 353,
      "TTTTA": 354,
      "GAGGC": 355,
      "TCAAAA": 356,
      "CCACA": 357,
      "GCTG": 358,
      "TACCC": 359,
      "GTTGG": 360,
      "GCAAAA": 361,
      "GCCACC": 362,
      "GATAC": 363,
      "AAACAA": 364,
      "GCGCCA": 365,
      "GAGCC": 366,
      "TCTGA": 367,
      "GGGCC": 368,
      "TTTTCA": 369,
      "GCTTA": 370,
      "TCATCA": 371,
      "GACCC": 372,
      "AAATA": 373,
      "GCTGGC": 374,
      "TCTTCA": 375,
      "TCGGA": 376,
      "TCGCA": 377,
      "GGCACC": 378,
      "TGATGA": 379,
      "TTGTT": 380,
      "TGTATT": 381,
      "GCTAC": 382,
      "TTATTA": 383,
      "GGGGC": 384,
      "TTCAAA": 385,
      "TCTAA": 386,
      "GGCCAA": 387,
      "TATAC": 388,
      "GCCGGC": 389,
      "GGTTC": 390,
      "GCGCCC": 391,
      "TTTTCC": 392,
      "TTTAA": 393,
      "TTTCA": 394,
      "TTTTC": 395,
      "TGCTC": 396,
      "GAACAA": 397,
      "TCTTCC": 398,
      "GATG": 399,
      "TGCTGG": 400,
      "GCGTA": 401,
      "GAATA": 402,
      "TTACAA": 403,
      "GCCGTC": 404,
      "TCGACC": 405,
      "TAAAAAA": 406,
      "GCGCAA": 407,
      "GGATC": 408,
      "TACCAA": 409,
      "TTCCA": 410,
      "GCCAAA": 411,
      "GGGGA": 412,
      "GGCAAA": 413,
      "TTGAA": 414,
      "GCCGGA": 415,
      "GTTCAA": 416,
      "GCACCA": 417,
      "TGGAAA": 418,
      "GCCTGC": 419,
      "TCTAC": 420,
      "TGGCCA": 421,
      "TCTTA": 422,
      "TCCACC": 423,
      "TCTCA": 424,
      "TGTG": 425,
      "GATGAA": 426,
      "TATCAA": 427,
      "TAACAA": 428,
      "GACGGC": 429,
      "GCCGTT": 430,
      "TCGTA": 431,
      "TATTCA": 432,
      "TGGTGG": 433,
      "TATAAA": 434,
      "TTCGA": 435,
      "TGACAA": 436,
      "GCAGGC": 437,
      "TGCACC": 438,
      "TGAAAC": 439,
      "GAAGC": 440,
      "TGATAA": 441,
      "GATAAA": 442,
      "TAGTA": 443,
      "TGTTCC": 444,
      "TGTAAA": 445,
      "GAAACC": 446,
      "TGTTAA": 447,
      "TAGCA": 448,
      "TCCGGC": 449,
      "TCAACA": 450,
      "TTTGC": 451,
      "TCACCA": 452,
      "TGATGC": 453,
      "TATATT": 454,
      "GCGGCA": 455,
      "GGAAAA": 456,
      "TTGGC": 457,
      "GTTGTT": 458,
      "GTCACC": 459,
      "GCTTCA": 460,
      "GATATT": 461,
      "TACAC": 462,
      "GGGTC": 463,
      "GGTAC": 464,
      "TGGTC": 465,
      "TAAAAC": 466,
      "GGTTA": 467,
      "GCGGCC": 468,
      "TGGCCC": 469,
      "TTTGA": 470,
      "TCAACC": 471,
      "GCACAA": 472,
      "TGTTCA": 473,
      "GATTAA": 474,
      "GCAGGA": 475,
      "GCCGAA": 476,
      "GCCGAC": 477,
      "GCATCA": 478,
      "GCTGAA": 479,
      "GTTTC": 480,
      "GAGTA": 481,
      "GCTTCC": 482,
      "GGTCC": 483,
      "GACAC": 484,
      "GTCGGC": 485,
      "GTGGAA": 486,
      "TTCTC": 487,
      "TGCGGC": 488,
      "GCGACC": 489,
      "TTTCC": 490,
      "TTATCA": 491,
      "GGTTTT": 492,
      "GCCGCA": 493,
      "GCCCAA": 494,
      "GCTGGA": 495,
      "TATTCC": 496,
      "TTATTTT": 497,
      "GGGTA": 498,
      "TGGTGC": 499,
      "GCTGCC": 500,
      "TGGTA": 501,
      "GAAAAC": 502,
      "TGTCGA": 503,
      "GTGAAA": 504,
      "TGAAAAA": 505,
      "TTATAA": 506,
      "TCCTGC": 507,
      "GTTTA": 508,
      "TGACCA": 509,
      "GGATA": 510,
      "TGAACA": 511,
      "GCCTTC": 512,
      "GCAACA": 513,
      "GGACAA": 514,
      "TGATCA": 515,
      "GGAGA": 516,
      "TGTGGC": 517,
      "GCAGTT": 518,
      "GCTGTT": 519,
      "GGCGTT": 520,
      "TGTCTT": 521,
      "TTCAAC": 522,
      "GCCAAC": 523,
      "TGATGG": 524,
      "TGCAAA": 525,
      "AAAACC": 526,
      "TAATC": 527,
      "TGAACC": 528,
      "TCCTC": 529,
      "GCCTC": 530,
      "GCAACC": 531,
      "CACTT": 532,
      "GAAACA": 533,
      "TCACAA": 534,
      "TCATA": 535,
      "GATGGC": 536,
      "TACAAA": 537,
      "GAAATT": 538,
      "TTCACC": 539,
      "GTCGTC": 540,
      "TCCAAA": 541,
      "TCAGC": 542,
      "GCAGAA": 543,
      "TTCGGC": 544,
      "CCCTT": 545,
      "TGTCCA": 546,
      "GACAAA": 547,
      "GGAACA": 548,
      "TGCCCA": 549,
      "TCCCAA": 550,
      "TATCTT": 551,
      "TGCGC": 552,
      "AACAAA": 553,
      "GTTAAA": 554,
      "GACCAA": 555,
      "GATGCC": 556,
      "GGAGG": 557,
      "TGGCAC": 558,
      "TGCTGA": 559,
      "TCGCCA": 560,
      "TTCTTTT": 561,
      "GAAAAAA": 562,
      "TGAATT": 563,
      "CCACCA": 564,
      "GTTTTA": 565,
      "GGTTAA": 566,
      "TCAATT": 567,
      "TGTGGA": 568,
      "TGGGG": 569,
      "TAAACC": 570,
      "TCAGCA": 571,
      "TCGCCC": 572,
      "GAAGGC": 573,
      "TCGACA": 574,
      "TCTTAA": 575,
      "TAGGC": 576,
      "TAAACA": 577,
      "GAGAC": 578,
      "TTCTGC": 579,
      "TCGGCA": 580,
      "TGGGC": 581,
      "TGGTGA": 582,
      "GATTCC": 583,
      "CCCGG": 584,
      "TGTGCC": 585,
      "GACGAC": 586,
      "GAATC": 587,
      "GAGTC": 588,
      "GTAAAC": 589,
      "GCCATT": 590,
      "GCTGCA": 591,
      "GTTCCA": 592,
      "GCTTAA": 593,
      "GATCAA": 594,
      "TTCCAA": 595,
      "TAGCC": 596,
      "TAGGA": 597,
      "GGCGGA": 598,
      "GGTTCA": 599,
      "TGTGCA": 600,
      "TGGAAC": 601,
      "GTGCAA": 602,
      "GCCCCA": 603,
      "GAAGTT": 604,
      "TACACC": 605,
      "GTATC": 606,
      "TGTCGG": 607,
      "GGCTGC": 608,
      "GTGCCC": 609,
      "GGTTCC": 610,
      "TGGTCA": 611,
      "GGAACC": 612,
      "GGTGGC": 613,
      "AAATAA": 614,
      "GGCGTC": 615,
      "GTGACC": 616,
      "GTGCCA": 617,
      "TTACCA": 618,
      "TGTGTT": 619,
      "TGATCC": 620,
      "GATTCA": 621,
      "CCACAA": 622,
      "GGGAC": 623,
      "GGCATT": 624,
      "TGATTTT": 625,
      "TCGGCC": 626,
      "TAATTTT": 627,
      "TAGTC": 628,
      "GTTGC": 629,
      "GCAATT": 630,
      "GGCGAA": 631,
      "GGATCA": 632,
      "GGCAAC": 633,
      "GTTTTC": 634,
      "TGGGA": 635,
      "GGAATT": 636,
      "GCATA": 637,
      "TGGACC": 638,
      "GCCCCC": 639,
      "TGGATT": 640,
      "GGCGAC": 641,
      "TACGG": 642,
      "TGTGAA": 643,
      "TCCGC": 644,
      "TGGCTT": 645,
      "TGAGC": 646,
      "GAATAA": 647,
      "AAAACA": 648,
      "GCGACA": 649,
      "GACACC": 650,
      "GCACCC": 651,
      "GATGTT": 652,
      "GTCAAA": 653,
      "TGAGG": 654,
      "GTTTCA": 655,
      "TTCTCC": 656,
      "TGTCAA": 657,
      "TGTACC": 658,
      "TATCCC": 659,
      "TGGTAA": 660,
      "TGGACA": 661,
      "GCTCAA": 662,
      "TTCGTC": 663,
      "GCATCC": 664,
      "GTTGAA": 665,
      "CCAGG": 666,
      "GTTACC": 667,
      "GGATGC": 668,
      "GCCGTA": 669,
      "TCGCGC": 670,
      "TTCTA": 671,
      "TCCACA": 672,
      "GCCACA": 673,
      "TCACCC": 674,
      "GTGAAC": 675,
      "TGCCGG": 676,
      "TTCTGG": 677,
      "TCATAA": 678,
      "AAAATT": 679,
      "TTCGC": 680,
      "GGATAA": 681,
      "AAAGA": 682,
      "TGTCGC": 683,
      "GGCGCA": 684,
      "GTACAA": 685,
      "GGCTC": 686,
      "TATGAA": 687,
      "TTCAC": 688,
      "GAACCA": 689,
      "GAGCGC": 690,
      "GTCCAA": 691,
      "GCCGCGC": 692,
      "GCCTGG": 693,
      "TCCCCA": 694,
      "AACGG": 695,
      "TTTTTTA": 696,
      "GGCCCA": 697,
      "GTTTAA": 698,
      "TCATCC": 699,
      "TATCCA": 700,
      "GGCCAC": 701,
      "TCAAAAA": 702,
      "GTTATT": 703,
      "TCAGGA": 704,
      "TTACTT": 705,
      "GACGAA": 706,
      "TCCCCC": 707,
      "TGCGA": 708,
      "TGCCTT": 709,
      "GGCTGG": 710,
      "GACGC": 711,
      "TGTATC": 712,
      "CCATC": 713,
      "TGATTA": 714,
      "TTTTTC": 715,
      "TTCAAAA": 716,
      "GCAGCC": 717,
      "TGGCGG": 718,
      "GGAGAA": 719,
      "GAGAAA": 720,
      "GGCACA": 721,
      "AACAAC": 722,
      "GTTCTT": 723,
      "GGCTTC": 724,
      "TCATTA": 725,
      "TGCACA": 726,
      "GGATGA": 727,
      "TTAATT": 728,
      "GCTCCA": 729,
      "TTCTAA": 730,
      "TGTACA": 731,
      "AAATC": 732,
      "GCTCTT": 733,
      "GCGATT": 734,
      "GTGTC": 735,
      "GGGCGC": 736,
      "TGCAAC": 737,
      "GCGGTT": 738,
      "TTTTTA": 739,
      "GATCTT": 740,
      "GGCCTT": 741,
      "TGCATT": 742,
      "TGAGTT": 743,
      "GGTGAA": 744,
      "GAGCAA": 745,
      "AAAGAA": 746,
      "TTATCC": 747,
      "TCAGTT": 748,
      "TACCCA": 749,
      "TTCGCC": 750,
      "TCCATT": 751,
      "GAGCTT": 752,
      "TTCGTT": 753,
      "GGTATT": 754,
      "GTAACC": 755,
      "TGCGCC": 756,
      "GATCGA": 757,
      "GTGGCC": 758,
      "GCTATT": 759,
      "GCGGAA": 760,
      "GATGAC": 761,
      "TCCGCC": 762,
      "GGCGCC": 763,
      "TGGGCA": 764,
      "TGTCCC": 765,
      "GACGCC": 766,
      "TGCCAC": 767,
      "GTATA": 768,
      "GTCGCC": 769,
      "GGCCGG": 770,
      "TGCCCC": 771,
      "GTGTA": 772,
      "GAGGAA": 773,
      "GGTAAA": 774,
      "TGTAAC": 775,
      "TTTTAAA": 776,
      "GCATTA": 777,
      "GCTAAA": 778,
      "GAAGTA": 779,
      "AAAAAAA": 780,
      "TCCGGA": 781,
      "GCGCTT": 782,
      "TACAAC": 783,
      "GACAAC": 784,
      "TAATTA": 785,
      "GACGTC": 786,
      "TGACCC": 787,
      "GATCCA": 788,
      "GTAATT": 789,
      "TGCTCA": 790,
      "GTGATT": 791,
      "GATGCA": 792,
      "GAATTA": 793,
      "TTCATT": 794,
      "GGGCAA": 795,
      "GTGGCA": 796,
      "TATGGC": 797,
      "TGCGGA": 798,
      "TTCTTA": 799,
      "GGCCCC": 800,
      "TGAGCA": 801,
      "GCTGAC": 802,
      "GGAGGA": 803,
      "GGGCGA": 804,
      "TCCAAC": 805,
      "GCGTCA": 806,
      "TGTATA": 807,
      "GCAAAC": 808,
      "GTCGTT": 809,
      "TGTCAC": 810,
      "TGTTAC": 811,
      "TGCGCA": 812,
      "GCGAAA": 813,
      "GATGGA": 814,
      "GAAGCC": 815,
      "TAGAC": 816,
      "GGTGCC": 817,
      "TGCGTT": 818,
      "TGGGTT": 819,
      "TACTC": 820,
      "GGTGTT": 821,
      "GACCCC": 822,
      "GTGCAC": 823,
      "TAATCA": 824,
      "TAACTT": 825,
      "TCCTCC": 826,
      "GGAAAAA": 827,
      "TTAAAAA": 828,
      "GAAGGA": 829,
      "GAGATT": 830,
      "TGCTTC": 831,
      "TATTTTA": 832,
      "GAAGCA": 833,
      "GCGTGC": 834,
      "TAGAAA": 835,
      "TAATGA": 836,
      "CCAGCA": 837,
      "GGCTGA": 838,
      "TCTGGC": 839,
      "GATACC": 840,
      "TCCTGA": 841,
      "GAACTT": 842,
      "GCAAAAA": 843,
      "GCCCTT": 844,
      "GTTTTTT": 845,
      "GTCATT": 846,
      "TGCTTTT": 847,
      "GCCGCCA": 848,
      "TGTAAAA": 849,
      "GCCTGA": 850,
      "TTAACA": 851,
      "TTCCCC": 852,
      "GCGTG": 853,
      "TGGGAA": 854,
      "GTCAAC": 855,
      "TCACTT": 856,
      "TTCTTCA": 857,
      "GCGCAC": 858,
      "GATATC": 859,
      "TATGTT": 860,
      "GACGTT": 861,
      "GGAGTT": 862,
      "GCAGTA": 863,
      "GAGGCC": 864,
      "GAATAC": 865,
      "TGGAAAA": 866,
      "GGCGTA": 867,
      "CACGG": 868,
      "TAACCA": 869,
      "TGCTCC": 870,
      "AAACTT": 871,
      "GAAGTC": 872,
      "TATTAC": 873,
      "TCGCGG": 874,
      "TACATT": 875,
      "TTCCCA": 876,
      "GTGGTT": 877,
      "TATTAAA": 878,
      "TGACTT": 879,
      "TTATGA": 880,
      "TAATAC": 881,
      "GATCGC": 882,
      "GAACCC": 883,
      "GCTCGA": 884,
      "TACCTT": 885,
      "TTCTGA": 886,
      "TAAGTT": 887,
      "TTAACC": 888,
      "TCATCAA": 889,
      "TCCGTT": 890,
      "GTACCA": 891,
      "TGGGGC": 892,
      "GGATTA": 893,
      "TAAACAA": 894,
      "GTTACA": 895,
      "GGGCTT": 896,
      "TACCCC": 897,
      "TTCTAC": 898,
      "TCAGGC": 899,
      "TATCGA": 900,
      "TATGCC": 901,
      "GTGACA": 902,
      "TCAAAC": 903,
      "TGGTTTT": 904,
      "GGTCGA": 905,
      "GTGCTT": 906,
      "TCGCTT": 907,
      "TGGTTA": 908,
      "GCATAA": 909,
      "GCCGCCC": 910,
      "TCGTCA": 911,
      "GCCTCC": 912,
      "GTAACA": 913,
      "TATATC": 914,
      "GATCAC": 915,
      "GAGCCA": 916,
      "GTATTA": 917,
      "TCAGAA": 918,
      "TAATAAA": 919,
      "GCGTTC": 920,
      "TCATGA": 921,
      "GTTTGA": 922,
      "TCATTTT": 923,
      "GATCCC": 924,
      "TAAAATT": 925,
      "GCACTT": 926,
      "TCTGTT": 927,
      "TTCCTT": 928,
      "GATAAC": 929,
      "TTCGAC": 930,
      "CCCGGC": 931,
      "TAATGC": 932,
      "GTCCAC": 933,
      "TCTCTT": 934,
      "GTAAAAA": 935,
      "TCCGCA": 936,
      "GTGGAC": 937,
      "TAAAAAAA": 938,
      "GTATTTT": 939,
      "TGGTAC": 940,
      "TAAGG": 941,
      "GAAGAC": 942,
      "TGAACAA": 943,
      "TGTGAC": 944,
      "TGAAAAAA": 945,
      "TGGCCAA": 946,
      "GGGCGG": 947,
      "TAGCTT": 948,
      "TGGGGA": 949,
      "TTAGTT": 950,
      "GCCCAC": 951,
      "TCTAAA": 952,
      "TTATTC": 953,
      "TGGGTA": 954,
      "GACCCA": 955,
      "TACGGC": 956,
      "GGACCA": 957,
      "TTACCC": 958,
      "GGGAAA": 959,
      "TGATGAA": 960,
      "GTTGGC": 961,
      "GGTGGA": 962,
      "GCGGAC": 963,
      "GTCGAC": 964,
      "GCGTGG": 965,
      "TAAAACA": 966,
      "TACTTTT": 967,
      "GCGAAC": 968,
      "GTTCAC": 969,
      "TAGCAA": 970,
      "TATAAC": 971,
      "GATCGG": 972,
      "GGTCAA": 973,
      "TGGTTC": 974,
      "GTTTCC": 975,
      "TCTATT": 976,
      "GAATCA": 977,
      "GCGTCC": 978,
      "TCTGGA": 979,
      "GGTGCA": 980,
      "GCGTGA": 981,
      "CCATCA": 982,
      "GACCTT": 983,
      "GGCGGCC": 984,
      "CCAACC": 985,
      "GTTTGC": 986,
      "TCTGCA": 987,
      "TCGATT": 988,
      "GAACAC": 989,
      "TGATAC": 990,
      "TAATCC": 991,
      "TCTGCC": 992,
      "GGGTG": 993,
      "GGGCCA": 994,
      "TATGGA": 995,
      "CCCAAA": 996,
      "GGTCTT": 997,
      "TGTTCAA": 998,
      "CCAACA": 999,
      "TGCTGGC": 1000,
      "TCTCCA": 1001,
      "GTCTTC": 1002,
      "GTTGTA": 1003,
      "TAATTC": 1004,
      "GACCAC": 1005,
      "GAAGAAA": 1006,
      "GATACA": 1007,
      "TGCAAAA": 1008,
      "GAGCGG": 1009,
      "TAAAACC": 1010,
      "GAGGTT": 1011,
      "GTTCCC": 1012,
      "GGAGCA": 1013,
      "TCAGCC": 1014,
      "GATATA": 1015,
      "GCTCGG": 1016,
      "GTCCTT": 1017,
      "GTCCCA": 1018,
      "TATCAAA": 1019,
      "GGTGAC": 1020,
      "TCCTTC": 1021,
      "CACAAA": 1022,
      "GGGATT": 1023,
      "GCATGA": 1024,
      "TAAATAA": 1025,
      "TCTGAA": 1026,
      "TCATGC": 1027,
      "GCAGCGC": 1028,
      "TTATTAA": 1029,
      "TTTTTAA": 1030,
      "TGGGCC": 1031,
      "TACTGC": 1032,
      "TACTTC": 1033,
      "GTCGAA": 1034,
      "GGCGCGC": 1035,
      "TAGATT": 1036,
      "GCTACC": 1037,
      "GCTCCC": 1038,
      "TATACC": 1039,
      "TATGCA": 1040,
      "TTTTTCA": 1041,
      "GATTAC": 1042,
      "CACCA": 1043,
      "GCTCGC": 1044,
      "TATCAC": 1045,
      "GGCGGCA": 1046,
      "TTATCAA": 1047,
      "GAGTTC": 1048,
      "TCGAAA": 1049,
      "TCCGTC": 1050,
      "TACAAAA": 1051,
      "GCAGAC": 1052,
      "GCATGG": 1053,
      "TCAGTA": 1054,
      "AAACCA": 1055,
      "TCATGG": 1056,
      "TAATATT": 1057,
      "GTGTTC": 1058,
      "TCGGTT": 1059,
      "TCGTCC": 1060,
      "GGATGG": 1061,
      "GGGTGA": 1062,
      "GTTGTC": 1063,
      "TAAGAA": 1064,
      "TCGTGC": 1065,
      "TAGTAA": 1066,
      "TTAGAA": 1067,
      "TCCTGG": 1068,
      "GCTATC": 1069,
      "GACGGA": 1070,
      "TGATTC": 1071,
      "GAGCGA": 1072,
      "GACATT": 1073,
      "GTCTGC": 1074,
      "TCTTCCA": 1075,
      "TAGCCA": 1076,
      "GAGCAC": 1077,
      "TGGCAAA": 1078,
      "TGATAAA": 1079,
      "GTATTC": 1080,
      "TATAAAA": 1081,
      "GTTGCC": 1082,
      "TGATATT": 1083,
      "AACGGC": 1084,
      "GATGTC": 1085,
      "TATACA": 1086,
      "GAAAACC": 1087,
      "GAATCC": 1088,
      "GGATTTT": 1089,
      "TGAAATT": 1090,
      "GGGTGC": 1091,
      "GGACTT": 1092,
      "GGAAAC": 1093,
      "GTTTAC": 1094,
      "TTATAAA": 1095,
      "TGGTGGC": 1096,
      "TCTCAA": 1097,
      "GCCACCA": 1098,
      "TACCAC": 1099,
      "TTATGC": 1100,
      "TCGCGA": 1101,
      "GCTCAC": 1102,
      "GTACTT": 1103,
      "GACTTC": 1104,
      "TTGACA": 1105,
      "TCGAAC": 1106,
      "GAATGC": 1107,
      "TTCACA": 1108,
      "GAAACAA": 1109,
      "GAGATC": 1110,
      "TATGAC": 1111,
      "GCATTTT": 1112,
      "GTCGTA": 1113,
      "GGATAC": 1114,
      "GAGCCC": 1115,
      "GGAGGC": 1116,
      "GAAAAAC": 1117,
      "TCGCAA": 1118,
      "GATAAAA": 1119,
      "GTATAA": 1120,
      "TCGCCCA": 1121,
      "TCCACCA": 1122,
      "GCTGTC": 1123,
      "TTCAACA": 1124,
      "GTAGTT": 1125,
      "GAGAAC": 1126,
      "GGCGCGG": 1127,
      "GTCACA": 1128,
      "TTATAC": 1129,
      "TCCCTT": 1130,
      "GAGGAC": 1131,
      "GCCGGCC": 1132,
      "GGATTC": 1133,
      "TACACA": 1134,
      "TGCTAA": 1135,
      "GCCAAAA": 1136,
      "TTATATT": 1137,
      "GGCAAAA": 1138,
      "GAATTC": 1139,
      "GCATTC": 1140,
      "GGCTCC": 1141,
      "GAGGCA": 1142,
      "CACCCA": 1143,
      "GCAGTC": 1144,
      "CCCGGA": 1145,
      "GGCTCA": 1146,
      "TCGACCA": 1147,
      "GCAGCAA": 1148,
      "GGCAACC": 1149,
      "GAATGG": 1150,
      "GAATGA": 1151,
      "GTAGG": 1152,
      "GAATTTT": 1153,
      "TCGTGG": 1154,
      "TGCGTC": 1155,
      "TGAAACC": 1156,
      "TAAAAAC": 1157,
      "TTATGG": 1158,
      "TGCCAAA": 1159,
      "GTATCA": 1160,
      "AACGCC": 1161,
      "TGCTGTT": 1162,
      "GTGAAAA": 1163,
      "TGATGGC": 1164,
      "TTTTCCA": 1165,
      "GTTGGA": 1166,
      "TGAAACA": 1167,
      "GTTGCA": 1168,
      "AAATCA": 1169,
      "TGAGGA": 1170,
      "TGCTGGA": 1171,
      "TGGACAA": 1172,
      "TGTGTA": 1173,
      "TGCGCCA": 1174,
      "TTCTCA": 1175,
      "GCCGACC": 1176,
      "TTAGTA": 1177,
      "GCAGGAA": 1178,
      "TGTGTC": 1179,
      "GTCCCC": 1180,
      "GGGGAA": 1181,
      "GGTCGG": 1182,
      "GGCTAC": 1183,
      "TGCTGAA": 1184,
      "GTTGAC": 1185,
      "CACCCC": 1186,
      "GTTTGG": 1187,
      "GCTACA": 1188,
      "GGCTTTT": 1189,
      "CCACTT": 1190,
      "GCTGTA": 1191,
      "TACTAA": 1192,
      "GCCTTTT": 1193,
      "GGGGCA": 1194,
      "TCCGGCA": 1195,
      "GAAAACA": 1196,
      "TCCTTTT": 1197,
      "GCAGCTT": 1198,
      "AACAAAA": 1199,
      "GCCAACC": 1200,
      "TGGAACA": 1201,
      "GGAGTA": 1202,
      "TCTACC": 1203,
      "TCTCCC": 1204,
      "TTATCTT": 1205,
      "TCGTG": 1206,
      "TGGCACC": 1207,
      "GCGGCCA": 1208,
      "GCAGGCC": 1209,
      "TAACCC": 1210,
      "GCTGGCC": 1211,
      "GAGACC": 1212,
      "TACTAC": 1213,
      "AAATTA": 1214,
      "TAAGTA": 1215,
      "GCGTAA": 1216,
      "TCCAAAA": 1217,
      "AACTGC": 1218,
      "TCGGAA": 1219,
      "GATGTA": 1220,
      "TGAGTA": 1221,
      "GCATCAA": 1222,
      "GAGGGC": 1223,
      "TGACAC": 1224,
      "GTGGCAA": 1225,
      "GACTGG": 1226,
      "TCATTC": 1227,
      "TCAGCAA": 1228,
      "TGCACAA": 1229,
      "CCAATT": 1230,
      "TATTTA": 1231,
      "TGAAGAA": 1232,
      "GGGTGG": 1233,
      "TTCAACC": 1234,
      "TGAGAA": 1235,
      "TGGCGGC": 1236,
      "TGATGTT": 1237,
      "GCCGCGA": 1238,
      "CCAGTT": 1239,
      "GCCGGCA": 1240,
      "GAGTG": 1241,
      "TAAATA": 1242,
      "CCACCC": 1243,
      "TTAGG": 1244,
      "GCCGGAA": 1245,
      "GCACAC": 1246,
      "AAAGG": 1247,
      "GAGGTC": 1248,
      "TAATGG": 1249,
      "TGAAAAC": 1250,
      "GCGCGG": 1251,
      "GTAGTA": 1252,
      "GCGCGGC": 1253,
      "GAAATA": 1254,
      "TCCGCCA": 1255,
      "TCGTTC": 1256,
      "TCCTCA": 1257,
      "AAATAC": 1258,
      "GCATGC": 1259,
      "GAGATA": 1260,
      "GTTAAC": 1261,
      "GCGTTA": 1262,
      "GCGGCCC": 1263,
      "GCTTAC": 1264,
      "TTATTTA": 1265,
      "TGATCAA": 1266,
      "GTCTGG": 1267,
      "GCTATA": 1268,
      "TCGTGA": 1269,
      "TGCAACA": 1270,
      "GGACAC": 1271,
      "TTTTTTC": 1272,
      "TGCTGCA": 1273,
      "GCCGCTT": 1274,
      "GAGTAA": 1275,
      "GGCGATC": 1276,
      "TATTTAA": 1277,
      "GTGTCA": 1278,
      "TTCTTCC": 1279,
      "GACTGC": 1280,
      "TCTATC": 1281,
      "TGAGCC": 1282,
      "TTCAATT": 1283,
      "GCAGCCA": 1284,
      "GAGTGC": 1285,
      "GGTATC": 1286,
      "GAGTTA": 1287,
      "TTCTTTA": 1288,
      "GTGTGG": 1289,
      "TTTCAAA": 1290,
      "TTATTGA": 1291,
      "TAAAGAA": 1292,
      "CCAGAA": 1293,
      "GCCTAC": 1294,
      "GGCTGGC": 1295,
      "TGGTGAA": 1296,
      "GTACCC": 1297,
      "TCTTTAA": 1298,
      "GTAGAA": 1299,
      "GGGGCC": 1300,
      "TGCTGCC": 1301,
      "GTATCC": 1302,
      "GTGTCC": 1303,
      "TGCTA": 1304,
      "GTCGGA": 1305,
      "GTGTTTT": 1306,
      "GGGGTT": 1307,
      "GACACA": 1308,
      "TACGTT": 1309,
      "AACTGG": 1310,
      "AACTTC": 1311,
      "GGCCACC": 1312,
      "AAACAAA": 1313,
      "TGTGGAA": 1314,
      "TGTTATT": 1315,
      "TGCTTA": 1316,
      "GTGTAA": 1317,
      "TATTTTC": 1318,
      "TCTACA": 1319,
      "GCCTCA": 1320,
      "TTACAAA": 1321,
      "GGCGACC": 1322,
      "TACTGG": 1323,
      "GGACCC": 1324,
      "TAGGAA": 1325,
      "GGGTCA": 1326,
      "GACAAAA": 1327,
      "TGTTCTT": 1328,
      "GGATCC": 1329,
      "GGTCCA": 1330,
      "TACTTA": 1331,
      "TGCACCA": 1332,
      "TAAATTA": 1333,
      "TGATGCC": 1334,
      "GCCGGGC": 1335,
      "AACAACA": 1336,
      "TGTTCCA": 1337,
      "TCGGCCA": 1338,
      "TGCCATT": 1339,
      "TGGTCC": 1340,
      "AAATCC": 1341,
      "TAGGTT": 1342,
      "GGTCAC": 1343,
      "GGCAACA": 1344,
      "GATGAAA": 1345,
      "TCTTTTA": 1346,
      "TACTGA": 1347,
      "TAGCGC": 1348,
      "CCCTGC": 1349,
      "TCACCCA": 1350,
      "TGGGCGA": 1351,
      "GCTGGAA": 1352,
      "TCGTAA": 1353,
      "GGTCGC": 1354,
      "GCCGTCA": 1355,
      "GTTTTAA": 1356,
      "TAGTGA": 1357,
      "TCTATA": 1358,
      "GCCTTA": 1359,
      "TTCGTA": 1360,
      "TGGGTC": 1361,
      "TGGTGGA": 1362,
      "GATTTTA": 1363,
      "GCCGCGG": 1364,
      "GCCAACA": 1365,
      "TTCGGA": 1366,
      "GCATAC": 1367,
      "TGCCGGA": 1368,
      "TGCTCAA": 1369,
      "TGGTGTT": 1370,
      "TCATCCA": 1371,
      "GACGGCC": 1372,
      "GCAGCAC": 1373,
      "GTCTCC": 1374,
      "GAGTGG": 1375,
      "TGATCGA": 1376,
      "GGGCAC": 1377,
      "TGCGGCA": 1378,
      "GCCGTGC": 1379,
      "AAAGTT": 1380,
      "GAAAATT": 1381,
      "GCAGAAA": 1382,
      "GGCTA": 1383,
      "TACTCC": 1384,
      "GACGGCA": 1385,
      "TCGCCAC": 1386,
      "TCTCGA": 1387,
      "GGGTAA": 1388,
      "TGCGCGA": 1389,
      "GCGCACC": 1390,
      "TAACAC": 1391,
      "TCTTTA": 1392,
      "TCAGCTT": 1393,
      "TTACAC": 1394,
      "GGTAAC": 1395,
      "GCGCCCA": 1396,
      "TCATCGA": 1397,
      "GCCGCAA": 1398,
      "GATCACC": 1399,
      "AAAGTA": 1400,
      "AAACCC": 1401,
      "GCTGACC": 1402,
      "TCAAAAC": 1403,
      "TCATTAA": 1404,
      "GCCCGGC": 1405,
      "GTGTGC": 1406,
      "TTCGCCA": 1407,
      "TACTA": 1408,
      "GCTAAC": 1409,
      "GCCGATC": 1410,
      "TACGAC": 1411,
      "GGGAAC": 1412,
      "TAAGGA": 1413,
      "GTGCCAA": 1414,
      "GCGGCAA": 1415,
      "TGGTCGA": 1416,
      "TGGTATT": 1417,
      "GTTTTCA": 1418,
      "TCATCTT": 1419,
      "CACCTT": 1420,
      "GCATGGC": 1421,
      "GCGCCAC": 1422,
      "GGCTTA": 1423,
      "GCTTCCA": 1424,
      "TGATCTT": 1425,
      "TCACCAA": 1426,
      "GGCACCA": 1427,
      "TCCGAA": 1428,
      "TCAGCCA": 1429,
      "GCCGGTT": 1430,
      "GTCAAAA": 1431,
      "TAATTAA": 1432,
      "GCCTTCA": 1433,
      "GTCTTTT": 1434,
      "TGGGCAA": 1435,
      "TGATTGA": 1436,
      "TAATTTA": 1437,
      "GTTAAAA": 1438,
      "GGGTTC": 1439,
      "TATTTC": 1440,
      "TGTGCCA": 1441,
      "GGGCGGC": 1442,
      "GTTTTTC": 1443,
      "GCAGCGG": 1444,
      "TAGCGA": 1445,
      "GAGACA": 1446,
      "TACGAA": 1447,
      "GAGTGA": 1448,
      "GCCTGCC": 1449,
      "TCCTGAA": 1450,
      "TGGGAC": 1451,
      "TGTTTTA": 1452,
      "TCAATAA": 1453,
      "TGCGAC": 1454,
      "TGCTTCA": 1455,
      "GCAGGTT": 1456,
      "TAGTTA": 1457,
      "GCCGAAC": 1458,
      "GTGTTA": 1459,
      "GATTAAA": 1460,
      "TATTATT": 1461,
      "GAGAAAA": 1462,
      "GAGCTC": 1463,
      "CCCAAC": 1464,
      "TGTCACC": 1465,
      "GCCGTCC": 1466,
      "TGTAATT": 1467,
      "GGCACAA": 1468,
      "TGCGTA": 1469,
      "TGGCATT": 1470,
      "GGATATT": 1471,
      "GTGTAC": 1472,
      "TCGCAC": 1473,
      "TGTTAAA": 1474,
      "TTCTTGA": 1475,
      "TCCTTA": 1476,
      "TAATGAA": 1477,
      "TGATGCA": 1478,
      "TTCGGCA": 1479,
      "GGAGAC": 1480,
      "GTTTTTA": 1481,
      "TGCCCCA": 1482,
      "GCAGCCC": 1483,
      "TAACAAA": 1484,
      "TAGATA": 1485,
      "TCAGGAA": 1486,
      "GAATATT": 1487,
      "TCGTTA": 1488,
      "TCCGTA": 1489,
      "TAGCCC": 1490,
      "TGGTAAA": 1491,
      "TCAACCA": 1492,
      "GAGTCA": 1493,
      "GCGTAC": 1494,
      "GCAAAAC": 1495,
      "GCCGACA": 1496,
      "GAAGAAC": 1497,
      "TGATGGA": 1498,
      "TAGCGG": 1499,
      "TGGGCGC": 1500,
      "TGAGGC": 1501,
      "TGCGCGC": 1502,
      "TCCGAC": 1503,
      "TGTTGTT": 1504,
      "CCCGCA": 1505,
      "TCGGAC": 1506,
      "GGTACA": 1507,
      "TCGGCAA": 1508,
      "GAAGCGC": 1509,
      "TCATAC": 1510,
      "TATATTTT": 1511,
      "TAGGCA": 1512,
      "GGTGTC": 1513,
      "TGCAATT": 1514,
      "TGGTGCA": 1515,
      "TCTCGG": 1516,
      "AACGAC": 1517,
      "TGCAACC": 1518,
      "GAAATAA": 1519,
      "TGATCCA": 1520,
      "GAAACCA": 1521,
      "TGCGAA": 1522,
      "TGTGAAA": 1523,
      "TCACAC": 1524,
      "TGACCAA": 1525,
      "GGATGAA": 1526,
      "GTTTATT": 1527,
      "TACCAAA": 1528,
      "GAGAGC": 1529,
      "TGTGGCA": 1530,
      "TTCGAA": 1531,
      "GCTGCCC": 1532,
      "GCCTGCA": 1533,
      "TCAGCGC": 1534,
      "GTCGGCA": 1535,
      "GCAGATT": 1536,
      "GGATGGC": 1537,
      "AACAACC": 1538,
      "GACGTA": 1539,
      "GCCTTCC": 1540,
      "GGAAAAC": 1541,
      "TGAGCAA": 1542,
      "TGACAAA": 1543,
      "TCACCCC": 1544,
      "TGGTCAA": 1545,
      "GCATCCA": 1546,
      "TGATTTA": 1547,
      "TTCTAAA": 1548,
      "GGATGCC": 1549,
      "GCATCGA": 1550,
      "TAGAAAA": 1551,
      "GACGACC": 1552,
      "GCAGGCA": 1553,
      "TGTCATT": 1554,
      "GCTGAAA": 1555,
      "GCCGGAC": 1556,
      "TCTTCAC": 1557,
      "GCACCAA": 1558,
      "TTATTCA": 1559,
      "TAATTCA": 1560,
      "GAAGCGG": 1561,
      "TCCTGCA": 1562,
      "GCCGAAA": 1563,
      "TCAGTC": 1564,
      "TATGTC": 1565,
      "TTCTGGC": 1566,
      "GCGACCA": 1567,
      "GCCTGGC": 1568,
      "GAGTAC": 1569,
      "GGCCGTC": 1570,
      "TTATGAA": 1571,
      "TCCCAC": 1572,
      "TTCTGGA": 1573,
      "GCCGATT": 1574,
      "TTCTCCA": 1575,
      "TGATTAA": 1576,
      "GCTTCAA": 1577,
      "GGCTGCC": 1578,
      "TGCTCCA": 1579,
      "GCCGTGG": 1580,
      "GCCGAGC": 1581,
      "GACTAC": 1582,
      "TAGAAC": 1583,
      "TGGTGCC": 1584,
      "TCTGAC": 1585,
      "TCTTCAA": 1586,
      "GGCTAA": 1587,
      "GGGCAAA": 1588,
      "TGAGCTT": 1589,
      "TTTTAAAA": 1590,
      "AACGTC": 1591,
      "TATTCCA": 1592,
      "TAGTGC": 1593,
      "GACGCGC": 1594,
      "GGCGATT": 1595,
      "GGAGTC": 1596,
      "TAAACCA": 1597,
      "GTACAC": 1598,
      "GGGCCC": 1599,
      "GCAGCGA": 1600,
      "GGAAACC": 1601,
      "GCCGGTC": 1602,
      "TGCTAC": 1603,
      "GCATTAA": 1604,
      "AACGTT": 1605,
      "TGTCCAA": 1606,
      "AACTCC": 1607,
      "TCTCGC": 1608,
      "TGCTTGA": 1609,
      "GGTGTA": 1610,
      "GCCTGAA": 1611,
      "GGCTTCC": 1612,
      "TACTCA": 1613,
      "GTCGCCA": 1614,
      "GCCTGTT": 1615,
      "GT": 1616,
      "GCCGTTC": 1617,
      "GACAACC": 1618,
      "GATCAAA": 1619,
      "GGTTAC": 1620,
      "TATTGTT": 1621,
      "TGCGCAA": 1622,
      "TTTTGTT": 1623,
      "TGATGAC": 1624,
      "GGCGGAA": 1625,
      "TCAACAA": 1626,
      "GAACAAA": 1627,
      "TAGTCA": 1628,
      "TGCGCTT": 1629,
      "CCCGTT": 1630,
      "TACAACA": 1631,
      "GGAGAAA": 1632,
      "TTTTTTAA": 1633,
      "GAAGATT": 1634,
      "GCCTTGA": 1635,
      "GTCGGCC": 1636,
      "GCAACAA": 1637,
      "TGGAATT": 1638,
      "GGCGCCC": 1639,
      "TGGCCCA": 1640,
      "TCATAAA": 1641,
      "GGTACC": 1642,
      "TGATTTC": 1643,
      "GCTAAAA": 1644,
      "TGATTCA": 1645,
      "GCAGTTC": 1646,
      "TTCTGCA": 1647,
      "TATGTA": 1648,
      "TTTATTA": 1649,
      "GTGGCCA": 1650,
      "GGCTTCA": 1651,
      "TTCTCTT": 1652,
      "TGGAACC": 1653,
      "GCATCTT": 1654,
      "TCATTGA": 1655,
      "GCGCCAA": 1656,
      "TCCTTCA": 1657,
      "TGGTTGA": 1658,
      "GACGCCC": 1659,
      "GGCGGGC": 1660,
      "AACTTTT": 1661,
      "GGATAAA": 1662,
      "TTCTGTT": 1663,
      "TAATCAA": 1664,
      "GAGTCC": 1665,
      "TTACCAA": 1666,
      "TGGGCTT": 1667,
      "GGGATC": 1668,
      "TAGTTC": 1669,
      "GGCGCTT": 1670,
      "GAAGGCC": 1671,
      "TAGTG": 1672,
      "TCATGGC": 1673,
      "TGGCACA": 1674,
      "GGCGTGC": 1675,
      "TCATCAC": 1676,
      "GCCAAAC": 1677,
      "GCACCCA": 1678,
      "AAATAAA": 1679,
      "TATTAAAA": 1680,
      "GATGGCC": 1681,
      "GCCGAGG": 1682,
      "GCACCCC": 1683,
      "CCCGTC": 1684,
      "AACTAA": 1685,
      "AAACAC": 1686,
      "TTGCCCA": 1687,
      "GGTATA": 1688,
      "TCAGAC": 1689,
      "GGGTTA": 1690,
      "TTTATTTT": 1691,
      "AC": 1692,
      "GTTGATT": 1693,
      "TTATTTC": 1694,
      "TGAACCA": 1695,
      "TGGCGGA": 1696,
      "GAATTAA": 1697,
      "TCATATT": 1698,
      "GCACCAC": 1699,
      "TTCTTTC": 1700,
      "AAATTTT": 1701,
      "TGCCGTT": 1702,
      "GGCGGTT": 1703,
      "GTCACCA": 1704,
      "GAATAAA": 1705,
      "TGTGGCC": 1706,
      "TCGCCAA": 1707,
      "GCCTA": 1708,
      "GTGGCCC": 1709,
      "GTCGCGG": 1710,
      "TTCTGAA": 1711,
      "TGCTCGA": 1712,
      "TTCTATT": 1713,
      "GTAACAA": 1714,
      "TCGGCCC": 1715,
      "TCAGA": 1716,
      "GCTGCCA": 1717,
      "GTCGCGC": 1718,
      "TCAGAAA": 1719,
      "GACGCA": 1720,
      "TACGGA": 1721,
      "GGGACA": 1722,
      "TATTTTAA": 1723,
      "GCCGCAC": 1724,
      "CCCGAA": 1725,
      "TGTACAA": 1726,
      "GTCGCCC": 1727,
      "TAAACTT": 1728,
      "AACGAA": 1729,
      "GTTTCTT": 1730,
      "GAAAAAAA": 1731,
      "GTTTTGA": 1732,
      "TCCTAA": 1733,
      "GATGACC": 1734,
      "TATCAAAA": 1735,
      "TATTTTTT": 1736,
      "GATTTAA": 1737,
      "GCAGGGC": 1738,
      "TCCGGCC": 1739,
      "GTTTTCC": 1740,
      "GGCGCCA": 1741,
      "GCTCACC": 1742,
      "GCCGCTC": 1743,
      "TCCGCAA": 1744,
      "GTTACAA": 1745,
      "GGCTGGA": 1746,
      "TCTGTA": 1747,
      "GCATTGA": 1748,
      "TGTGCAA": 1749,
      "TCCGCGC": 1750,
      "TGGAAAAA": 1751,
      "TGGGCCA": 1752,
      "AACTAC": 1753,
      "GGAAGAA": 1754,
      "TAAATTTT": 1755,
      "TCCAACA": 1756,
      "TCCTCCA": 1757,
      "TTCACCA": 1758,
      "TCTTAC": 1759,
      "TGTTACC": 1760,
      "TCAAACA": 1761,
      "GACGATC": 1762,
      "TTCAAAC": 1763,
      "GACTTA": 1764,
      "TGCCGTC": 1765,
      "TGTGATT": 1766,
      "TGCTCTT": 1767,
      "TGGGCGG": 1768,
      "GTAGTC": 1769,
      "TCGCCCC": 1770,
      "GCTGGCA": 1771,
      "TAGACA": 1772,
      "TCATCGG": 1773,
      "GACGCCA": 1774,
      "GGCGTGG": 1775,
      "TAGTGG": 1776,
      "TGCGGTT": 1777,
      "TGCGGCC": 1778,
      "GGCGAAA": 1779,
      "GCTGCAA": 1780,
      "TTCAAAAA": 1781,
      "TTCCC": 1782,
      "TTATCCA": 1783,
      "TAAGAAA": 1784,
      "TGAGTC": 1785,
      "TAATCTT": 1786,
      "TGCCACC": 1787,
      "TATCAAC": 1788,
      "TGTGGTT": 1789,
      "TCCTTGA": 1790,
      "TCGATCA": 1791,
      "TTCGCCC": 1792,
      "TATTGAA": 1793,
      "TACGTC": 1794,
      "TGCCACA": 1795,
      "TCCAACC": 1796,
      "TGCCCAA": 1797,
      "TCCTGTT": 1798,
      "TAAAGTA": 1799,
      "TACAACC": 1800,
      "GCTGTTC": 1801,
      "TCATGAA": 1802,
      "CACAAC": 1803,
      "TAAGTC": 1804,
      "TTAGA": 1805,
      "TAAGCA": 1806,
      "GGCGCGA": 1807,
      "TAAAGTT": 1808,
      "GCCCACC": 1809,
      "GTTCAAA": 1810,
      "GCGCCCC": 1811,
      "GTAAAAAA": 1812,
      "TGCGCCC": 1813,
      "TGGCGTT": 1814,
      "TAATTTC": 1815,
      "TTAGCA": 1816,
      "TGGGTGA": 1817,
      "TGCTGAC": 1818,
      "GGAGGAA": 1819,
      "GGTCCC": 1820,
      "GACCACC": 1821,
      "TTACCCA": 1822,
      "GGGATA": 1823,
      "GCCACCC": 1824,
      "TTTTGAA": 1825,
      "TGGTTCA": 1826,
      "GGCTGAA": 1827,
      "AAAAAAC": 1828,
      "GACTCC": 1829,
      "GACAACA": 1830,
      "GGGGGC": 1831,
      "GGCGTTC": 1832,
      "TGAGAAA": 1833,
      "GATGCCC": 1834,
      "TCACCAC": 1835,
      "TGGCAAC": 1836,
      "GCAGCTC": 1837,
      "GCCGTGA": 1838,
      "TCCGCGA": 1839,
      "TTAGGA": 1840,
      "TAGCAC": 1841,
      "TTAGAAA": 1842,
      "TCAGGTT": 1843,
      "GACTTTT": 1844,
      "GAAGCCC": 1845,
      "TTGCAAA": 1846,
      "TGCAGGA": 1847,
      "TCTGTC": 1848,
      "GTTTGAA": 1849,
      "TGATCGG": 1850,
      "GAGAGG": 1851,
      "TTTACCA": 1852,
      "TCAGCGA": 1853,
      "GAAGCCA": 1854,
      "GGCGCTC": 1855,
      "TTGGAAA": 1856,
      "GGGGAC": 1857,
      "GTTTGTT": 1858,
      "TAATGTT": 1859,
      "TGGTCTT": 1860,
      "TCTCAC": 1861,
      "GAAGCAA": 1862,
      "TAGAGC": 1863,
      "GCGTGGC": 1864,
      "GTGACAA": 1865,
      "GCATATT": 1866,
      "GCTTCAC": 1867,
      "TGTGCTT": 1868,
      "GCAGACC": 1869,
      "GTTTAAA": 1870,
      "GTTGAAA": 1871,
      "TATTCAA": 1872,
      "GATCGTC": 1873,
      "GCATCGG": 1874,
      "GACGCGG": 1875,
      "GGGACC": 1876,
      "GGCAATT": 1877,
      "TGAGCCA": 1878,
      "GCTTCTT": 1879,
      "GGTCGTC": 1880,
      "TCTTAAA": 1881,
      "TGAACTT": 1882,
      "GCCACAA": 1883,
      "GCCTGGA": 1884,
      "GCCTAA": 1885,
      "CCAGGA": 1886,
      "TAGACC": 1887,
      "TTCTCAA": 1888,
      "GCGCTGC": 1889,
      "GAAGGAA": 1890,
      "GCTTTAA": 1891,
      "GGGAGA": 1892,
      "GGCGACA": 1893,
      "TCTAAAA": 1894,
      "TTTATAA": 1895,
      "GTTTCAA": 1896,
      "TCGATGA": 1897,
      "GGATCAA": 1898,
      "GCGGAAA": 1899,
      "GGTAAAA": 1900,
      "TCAAACC": 1901,
      "GATCAAC": 1902,
      "GCAACCA": 1903,
      "TACTTCA": 1904,
      "TCATTCA": 1905,
      "TTCGTCA": 1906,
      "GCTCAAA": 1907,
      "GTAAAAC": 1908,
      "TTATTAC": 1909,
      "TTTTTTCA": 1910,
      "TTCTTAA": 1911,
      "GAACAAC": 1912,
      "TGACCCA": 1913,
      "TCAGCAC": 1914,
      "TCCGGAA": 1915,
      "GGCGTCA": 1916,
      "AACAATT": 1917,
      "GAATGGC": 1918,
      "TCGTCCA": 1919,
      "GGCCAAA": 1920,
      "GGCTGTT": 1921,
      "TCACCTT": 1922,
      "TGGAAAC": 1923,
      "GTTCACC": 1924,
      "TGGTGAC": 1925,
      "GCAAACC": 1926,
      "TAGAGA": 1927,
      "GATGGCA": 1928,
      "TGCCCCC": 1929,
      "TGGCCTT": 1930,
      "TGCTTTA": 1931,
      "TATAAAAA": 1932,
      "TCCTCAA": 1933,
      "AAAATAA": 1934,
      "GAGGAAA": 1935,
      "CCAAAAA": 1936,
      "GGCGCAA": 1937,
      "TGCTAAA": 1938,
      "GATTATT": 1939,
      "TGGCCAC": 1940,
      "TGGGATT": 1941,
      "GGCAAAC": 1942,
      "CCATAA": 1943,
      "TTCGGCC": 1944,
      "GGCGAAC": 1945,
      "TATATAA": 1946,
      "GCGCAAA": 1947,
      "GCATCAC": 1948,
      "TCTAAC": 1949,
      "GCAGGTC": 1950,
      "TTATTCC": 1951,
      "TGCGGAA": 1952,
      "TGGGAAA": 1953,
      "TCGTAC": 1954,
      "TGCTATT": 1955,
      "TGAATAA": 1956,
      "TACGCC": 1957,
      "GAAGACC": 1958,
      "GGGAGC": 1959,
      "TTTCTTTT": 1960,
      "TTACCTT": 1961,
      "TCCGCCC": 1962,
      "GTAAACC": 1963,
      "GGCGGTC": 1964,
      "GTTGCCA": 1965,
      "TGTAAAC": 1966,
      "TATGAAA": 1967,
      "TCCGCTT": 1968,
      "TGCGCGG": 1969,
      "GTATTGA": 1970,
      "GCAGGAC": 1971,
      "TAGGCC": 1972,
      "TTCTGCC": 1973,
      "TCCGGTT": 1974,
      "TGTTTTAA": 1975,
      "GAAGCTT": 1976,
      "GAAGGCA": 1977,
      "GTCAACC": 1978,
      "TGTCAAA": 1979,
      "GATGGAA": 1980,
      "GTATCAA": 1981,
      "GCGGCAC": 1982,
      "GCAGATC": 1983,
      "GGCGAGC": 1984,
      "AAAACCA": 1985,
      "TGTCATC": 1986,
      "GAATATC": 1987,
      "TTATTGG": 1988,
      "TGGGGCA": 1989,
      "GCCTCCA": 1990,
      "GATGCCA": 1991,
      "GGCCGGA": 1992,
      "TATTACA": 1993,
      "TAAATAC": 1994,
      "GTGGAAA": 1995,
      "GCATGAA": 1996,
      "TGGGTGC": 1997,
      "TTTTTGA": 1998,
      "GGTTAAA": 1999,
      "TCTTTCA": 2000,
      "TTCGCGC": 2001,
      "GATGAAC": 2002,
      "TGGTTAA": 2003,
      "TACACCA": 2004,
      "TCATCGC": 2005,
      "TGGATGA": 2006,
      "GTTTCCA": 2007,
      "GTAATAA": 2008,
      "TGGATAA": 2009,
      "GTGTGA": 2010,
      "GACGATT": 2011,
      "TTCGATT": 2012,
      "GTAAATT": 2013,
      "GGCACCC": 2014,
      "TAAATCA": 2015,
      "TCAAATT": 2016,
      "GTAAACA": 2017,
      "GCTGATT": 2018,
      "GTGCACC": 2019,
      "TGGTCGG": 2020,
      "GCCAATT": 2021,
      "GTATTCA": 2022,
      "TTTTTCTT": 2023,
      "TATTTCA": 2024,
      "GAACACC": 2025,
      "TTGATAA": 2026,
      "GTTTGGC": 2027,
      "GGCGGAC": 2028,
      "GGTTTTA": 2029,
      "TTCGCTT": 2030,
      "GAGCAAA": 2031,
      "AACGGA": 2032,
      "AACTGA": 2033,
      "TTTTTCC": 2034,
      "GCAGAAC": 2035,
      "GTATTAA": 2036,
      "GCGTGCC": 2037,
      "GTCAACA": 2038,
      "TATATTA": 2039,
      "GGCCGCC": 2040,
      "GGTCAAA": 2041,
      "TCTTCTT": 2042,
      "TGCGATT": 2043,
      "CCCGCC": 2044,
      "GCACAAA": 2045,
      "TGCTTCC": 2046,
      "GGATCGA": 2047,
      "GTGAACA": 2048,
      "GTAGA": 2049,
      "TCACAAA": 2050,
      "GCATTCA": 2051,
      "TTATTAAA": 2052,
      "GTGTTCC": 2053,
      "GGCGTCC": 2054,
      "TGTTTTTT": 2055,
      "GTTAATT": 2056,
      "GGCGAGG": 2057,
      "GCTGATC": 2058,
      "GCGAAAA": 2059,
      "GGCCCCC": 2060,
      "GCATAAA": 2061,
      "CCCGGCC": 2062,
      "TTTTTAC": 2063,
      "GTGTTAA": 2064,
      "GCAAACA": 2065,
      "CCACCCC": 2066,
      "TTAATAA": 2067,
      "TGACCCC": 2068,
      "GCAATAA": 2069,
      "TCGGTGA": 2070,
      "GGCTGCA": 2071,
      "GTGAAAC": 2072,
      "GATTCCA": 2073,
      "AACGCCA": 2074,
      "TCGCGGA": 2075,
      "GAAGATC": 2076,
      "TGGTTTC": 2077,
      "TCCTCGA": 2078,
      "GCTGAAC": 2079,
      "TACGA": 2080,
      "TAAAGAAA": 2081,
      "TAGCTC": 2082,
      "GCAGTGC": 2083,
      "TCCGA": 2084,
      "GACTTCA": 2085,
      "GACTGA": 2086,
      "GCTTAAA": 2087,
      "GTTTGCC": 2088,
      "GAATTTC": 2089,
      "GAACCCC": 2090,
      "TGACCTT": 2091,
      "TTTTTATT": 2092,
      "GACGAAC": 2093,
      "GCCGGGG": 2094,
      "TCCTGGC": 2095,
      "GTATGA": 2096,
      "GCCTCGA": 2097,
      "GATAACC": 2098,
      "TCAGGCA": 2099,
      "TGTGCCC": 2100,
      "TCAGCCC": 2101,
      "GTCGACC": 2102,
      "GTCTTCA": 2103,
      "GCATCGC": 2104,
      "GCTGGAC": 2105,
      "TAGGTA": 2106,
      "GCACCTT": 2107,
      "GTGACCA": 2108,
      "TGATCCC": 2109,
      "TTATGTT": 2110,
      "TCCGTCA": 2111,
      "TTTTCCC": 2112,
      "TATAACC": 2113,
      "GGGTAC": 2114,
      "GCCGCGCC": 2115,
      "GGCCTGC": 2116,
      "TCCTAC": 2117,
      "TTATTGC": 2118,
      "TCCTGGA": 2119,
      "GACGAAA": 2120,
      "GTAGGA": 2121,
      "GTGAACC": 2122,
      "TGCCAAC": 2123,
      "TATAATT": 2124,
      "GTCCACC": 2125,
      "TGAGCGA": 2126,
      "GATGATT": 2127,
      "GGGTCC": 2128,
      "GCAGCGCC": 2129,
      "TGATTCC": 2130,
      "GTTGGTT": 2131,
      "TGGGTG": 2132,
      "TGCAAAAA": 2133,
      "GTTGCTT": 2134,
      "TGTAACC": 2135,
      "TTTTTCAA": 2136,
      "TTGACCA": 2137,
      "GGGGGA": 2138,
      "TGAGCGC": 2139,
      "GTCTAC": 2140,
      "GTCGATC": 2141,
      "TGTTGAA": 2142,
      "GTCGTCA": 2143,
      "CACGGC": 2144,
      "TCCTGCC": 2145,
      "GCCTCAA": 2146,
      "GGGAGG": 2147,
      "TCATGCC": 2148,
      "GTTCCCC": 2149,
      "TTAAAAC": 2150,
      "GCCGTG": 2151,
      "GACTAA": 2152,
      "TATTTAC": 2153,
      "GACGACA": 2154,
      "GACTGGC": 2155,
      "TATTCTT": 2156,
      "GCGTTTT": 2157,
      "GGACAAA": 2158,
      "GATTTTC": 2159,
      "GGAGCGC": 2160,
      "TATCTTTT": 2161,
      "TAGAGG": 2162,
      "TGCCCTT": 2163,
      "TCAGGCC": 2164,
      "GGATGTT": 2165,
      "GATAAAC": 2166,
      "TTAGCAA": 2167,
      "GGAAACA": 2168,
      "CCAGTA": 2169,
      "TGATCGC": 2170,
      "GCGGCTT": 2171,
      "TGTACTT": 2172,
      "GCCCAAA": 2173,
      "GCCTTGC": 2174,
      "TCTTCCC": 2175,
      "TGAAGTT": 2176,
      "TCCCAAA": 2177,
      "TAACCAA": 2178,
      "TTTTCAC": 2179,
      "TTCGCA": 2180,
      "GGTGGCC": 2181,
      "TCAGATT": 2182,
      "TGCTTTC": 2183,
      "TAATTGA": 2184,
      "TAGCAAA": 2185,
      "GAATCAA": 2186,
      "GCTGCTT": 2187,
      "TGGGGTT": 2188,
      "TGGAGGA": 2189,
      "TGAGGAA": 2190,
      "GCTTTTA": 2191,
      "TCAGCGG": 2192,
      "GACGTGC": 2193,
      "TAAAAACA": 2194,
      "AACGGCA": 2195,
      "TGAGATT": 2196,
      "CATCAAA": 2197,
      "AACTTA": 2198,
      "TTCCAAA": 2199,
      "GTCTC": 2200,
      "GACTC": 2201,
      "GCCGCGGC": 2202,
      "TTCGGTT": 2203,
      "GTTGCGC": 2204,
      "GGCCATT": 2205,
      "TAAATAAA": 2206,
      "GTGTTCA": 2207,
      "GAAACCC": 2208,
      "TTCGACC": 2209,
      "TCAACAC": 2210,
      "GGCCGGC": 2211,
      "GAAGTTC": 2212,
      "GATAATT": 2213,
      "AACTTCA": 2214,
      "GCACACC": 2215,
      "TGTTATC": 2216,
      "TGTTACA": 2217,
      "GATCATC": 2218,
      "TCGCAAA": 2219,
      "GTATGG": 2220,
      "CCAGCGC": 2221,
      "GGAGCGG": 2222,
      "TACGGCA": 2223,
      "GCCATCA": 2224,
      "GGCCACA": 2225,
      "GTGGACC": 2226,
      "TGATAAC": 2227,
      "GGCTTTC": 2228,
      "GCCTCGG": 2229,
      "TACAATT": 2230,
      "CCATTTT": 2231,
      "TTACAAAA": 2232,
      "GGCTTGA": 2233,
      "CACAAAA": 2234,
      "GTTTATC": 2235,
      "GCCCTGC": 2236,
      "TCAATA": 2237,
      "GTGTCGA": 2238,
      "TCGACAA": 2239,
      "GAAGTGC": 2240,
      "GAATACC": 2241,
      "GGCGCAC": 2242,
      "GAAATTA": 2243,
      "GTATGC": 2244,
      "GTTGTTC": 2245,
      "GTATTTA": 2246,
      "GACTTCC": 2247,
      "GGGAAAA": 2248,
      "GAAGCGA": 2249,
      "GGCGTGA": 2250,
      "GCGCCTT": 2251,
      "TGGTTTA": 2252,
      "GATTCAA": 2253,
      "GGATCGG": 2254,
      "GCATCCC": 2255,
      "GAATGCC": 2256,
      "CCAGTC": 2257,
      "TGATTGG": 2258,
      "TGTAACA": 2259,
      "TCGACCC": 2260,
      "TTCGCGG": 2261,
      "GGATTAA": 2262,
      "GAAGGTT": 2263,
      "TGATCAC": 2264,
      "TAAATC": 2265,
      "TTCTTGC": 2266,
      "GACGAGC": 2267,
      "GGATGAC": 2268,
      "TAATCCA": 2269,
      "TTTTTTTA": 2270,
      "GCTCGTC": 2271,
      "GTCACAA": 2272,
      "GATTTA": 2273,
      "CCCAACC": 2274,
      "CCATCC": 2275,
      "GACGGTT": 2276,
      "GCATTTC": 2277,
      "GCAGATA": 2278,
      "GGATTTC": 2279,
      "GCTTCCC": 2280,
      "TCGGAAA": 2281,
      "TGACCAC": 2282,
      "TATTTATT": 2283,
      "TACGCCA": 2284,
      "TAATTCC": 2285,
      "TAATATA": 2286,
      "TGGGGAA": 2287,
      "GTGCTGC": 2288,
